[{"title":"Kotlin Support in Fleet: Explore a New IDE from JetBrains","date":"Tue, 10 Oct 2023 10:29:44 +0000","link":"https://blog.jetbrains.com/kotlin/2023/10/kotlin-support-in-jetbrains-fleet/","image":"latest-news/news-0.png","description":"JetBrains Fleet is a lightweight code editor and IDE that uses the IntelliJ code-processing engine. The product is now in public preview, so everyone can try it. Currently, Fleet allows you to develop in Python, TypeScript / JavaScript, Go, Java, PHP, C#, and other popular languages such as Kotlin. Kotlin support is one of the [&#8230;]"},{"title":"Join Us for a Live Introduction to Algorithmic Challenges in Kotlin!","date":"Tue, 12 Sep 2023 10:56:41 +0000","link":"https://blog.jetbrains.com/kotlin/2023/09/algorithmic-challenges-in-kotlin-live/","image":"latest-news/news-1.png","description":"Are you preparing for technical interviews, or do you simply want to master algorithms? Join us for a practical livestream where we’ll introduce the Algorithmic Challenges in Kotlin course! In this session, we’ll cover the main topics from the Algorithmic Challenges in Kotlin course, which prepares participants for coding interviews and provides a solid understanding [&#8230;]"},{"title":"Kotlin News: KotlinConf 2024 Tickets, Compose Multiplatform 1.5.0, Grants Program Winners, and More","date":"Wed, 30 Aug 2023 12:24:10 +0000","link":"https://blog.jetbrains.com/kotlin/2023/08/kotlin-news-jul-aug-23/","image":"latest-news/news-2.png","description":"In this new edition of the Kotlin digest, we’re bringing you the most exciting news and updates from July and August. KotlinConf 2024 tickets are now available! KotlinConf is bringing the Kotlin community together for the fifth time on May 22–24, 2024, at the Bella Center in Copenhagen, Denmark! There will be workshops, talks, networking [&#8230;]"},{"title":"Compose Multiplatform 1.5.0 Release","date":"Mon, 28 Aug 2023 14:24:24 +0000","link":"https://blog.jetbrains.com/kotlin/2023/08/compose-multiplatform-1-5-0-release/","image":"latest-news/news-3.png","description":"As of today, Compose Multiplatform 1.5.0 is available for you to use. It takes the Jetpack Compose declarative UI framework for Kotlin and extends it beyond Android to desktop, iOS, and web. The desktop version is stable, iOS is in Alpha, and support for web is experimental. For a full introduction, see the Compose Multiplatform [&#8230;]"}]