[
  {
    "title": "Amper Update – December 2023",
    "date": "Thu, 21 Dec 2023 11:42:47 +0000",
    "link": "https://blog.jetbrains.com/amper/2023/12/amper-update-december-2023/",
    "image": "latest-news/news-0.png",
    "description": "Last month JetBrains introduced Amper, a tool to improve the project configuration user experience. It offers concise, declarative configuration with sensible defaults for common use cases and carefully considered extension points. Since then, we’ve received a lot of feedback from the community and have continued our development work as well. In this post, we’ll recap [&#8230;]"
  },
  {
    "title": "Kandy: the new Kotlin plotting library by JetBrains",
    "date": "Thu, 14 Dec 2023 15:58:36 +0000",
    "link": "https://blog.jetbrains.com/kotlin/2023/12/kandy-the-new-kotlin-plotting-library-by-jetbrains/",
    "image": "latest-news/news-1.png",
    "description": "We are excited to introduce Kandy, a new Kotlin plotting library by JetBrains. It provides a new, powerful DSL for creating charts of various kinds. The first public preview version is ready for you to try, and we welcome any feedback and comments you may have. Kandy Documentation How does it look and feel? Why [&#8230;]"
  },
  {
    "title": "KotlinConf Global 2024: Uniting Kotlin Enthusiasts Worldwide!",
    "date": "Tue, 12 Dec 2023 11:52:46 +0000",
    "link": "https://blog.jetbrains.com/kotlin/2023/12/kotlinconf-global-2024-uniting-kotlin-enthusiasts-worldwide/",
    "image": "latest-news/news-2.png",
    "description": "KotlinConf Global returns next year, in May. This means that no matter where you are in the world, you can join us in celebrating all things Kotlin. At KotlinConf 2024, you can expect a great lineup of keynotes, sessions, and workshops, delivered by industry experts and Kotlin enthusiasts. The attendees will be able to deep [&#8230;]"
  },
  {
    "title": "Kotlin for WebAssembly Goes Alpha",
    "date": "Thu, 07 Dec 2023 12:56:36 +0000",
    "link": "https://blog.jetbrains.com/kotlin/2023/12/kotlin-for-webassembly-goes-alpha/",
    "image": "latest-news/news-3.png",
    "description": "Kotlin/Wasm, the newest Kotlin Multiplatform target platform, has reached Alpha status! Here’s what you need to know about this change at a glance: Get started with Kotlin/Wasm WebAssembly: The newest Kotlin Multiplatform target WebAssembly is establishing itself as the standard compilation target for languages targeting the browser – and beyond! With Kotlin/Wasm, we’re giving you [&#8230;]"
  }
]