[
  {
    "title": "Welcome Fleet with Kotlin Multiplatform Tooling",
    "date": "Tue, 07 Nov 2023 14:24:34 +0000",
    "link": "https://blog.jetbrains.com/kotlin/2023/11/kotlin-multiplatform-tooling-in-fleet/",
    "image": "latest-news/news-0.png",
    "description": "Kotlin Multiplatform (KMP) is an open-source technology built by JetBrains that allows you to share code across multiple platforms while retaining the benefits of native programming. Supported platforms include iOS, Android, desktop, web, and others. Today, we&#8217;re launching a preview for Kotlin Multiplatform support in Fleet, which simplifies the development of multiplatform applications, adding to [&#8230;]"
  },
  {
    "title": "Compose Multiplatform 1.5.10 – The Perfect Time To Get Started",
    "date": "Thu, 02 Nov 2023 12:01:27 +0000",
    "link": "https://blog.jetbrains.com/kotlin/2023/11/compose-multiplatform-1-5-10-release/",
    "image": "latest-news/news-1.png",
    "description": "Compose Multiplatform is a declarative UI framework built by JetBrains that allows developers to share their applications’ UIs across different platforms. It enables you to reuse up to 100% of your codebase across Android, iOS, desktop, and web. The framework leverages the code-sharing capabilities of the core Kotlin Multiplatform technology, which just became Stable in [&#8230;]"
  },
  {
    "title": "Kotlin Multiplatform Is Stable and Production-Ready",
    "date": "Wed, 01 Nov 2023 11:31:28 +0000",
    "link": "https://blog.jetbrains.com/kotlin/2023/11/kotlin-multiplatform-stable/",
    "image": "latest-news/news-2.png",
    "description": "In a highly anticipated move, Kotlin Multiplatform, an open-source technology built by JetBrains that allows developers to share code across platforms while retaining the benefits of native programming, has become Stable and is now 100% ready for use in production. Read on to learn about the evolution of Kotlin Multiplatform (KMP), how it can streamline [&#8230;]"
  },
  {
    "title": "Kotlin 1.9.20 Released",
    "date": "Wed, 01 Nov 2023 11:29:19 +0000",
    "link": "https://blog.jetbrains.com/kotlin/2023/11/kotlin-1-9-20-released/",
    "image": "latest-news/news-3.png",
    "description": "The Kotlin 1.9.20 release is out, the K2 compiler for all the targets is now in Beta, and Kotlin Multiplatform is now Stable. Here are some highlights from this release: For the complete list of changes, refer to What&#8217;s new in Kotlin 1.9.20 or the release notes on GitHub. The New Kotlin K2 Compiler Is [&#8230;]"
  }
]